src/Catalogs/НДС/НДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НДС</name>
  <predefined>
    <items>
      <name>none</name>
      <description>без НДС</description>
    </items>
    <items>
      <name>vat0</name>
      <description>0%</description>
    </items>
    <items>
      <name>vat10</name>
      <description>10%</description>
    </items>
    <items>
      <name>vat110</name>
      <description>10% / 110%</description>
    </items>
    <items>
      <name>vat118</name>
      <description>18% / 118%</description>
    </items>
    <items>
      <name>vat18</name>
      <description>18%</description>
    </items>
    <items>
      <name>vat20</name>
      <description>20%</description>
    </items>
  </predefined>
  <attributes>
    <name>ПроцентНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Делитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НДС/ManagerModule.bsl
procedure ЗаполнитьСправочникНДС() export
	
	SetParamsНДС(Справочники.НДС.none,  0,  false);	
	SetParamsНДС(Справочники.НДС.vat0,  0,  true);	
	SetParamsНДС(Справочники.НДС.vat10, 10, true);	
	SetParamsНДС(Справочники.НДС.vat110,10, true, 110);	
	SetParamsНДС(Справочники.НДС.vat118,18, true, 180);	
	SetParamsНДС(Справочники.НДС.vat18, 18, true);	
	SetParamsНДС(Справочники.НДС.vat20, 20, true);	
	
endprocedure	

procedure SetParamsНДС(ref, persent, use, delitel = 1)
	objНДС = ref.GetObject();
	objНДС.процентНДС   = persent;
	objНДС.Делитель     = delitel;
	objНДС.Рассчитывать = use;
	
	objНДС.Write();
endprocedure
